# Project 1.1: Analyzing Baby Names
## Task 1
#### The document consists of 3 columns which are separated by commas and do not have a header.

In [1]:
import pandas as pd
from matplotlib import pyplot as plt
import seaborn as sns

## Task 2
#### Reading the file into pandas with a new header.

In [83]:
df = pd.read_csv("./names/yob2021.txt", header=0, names = ["name", "gender", "count"])

## Task 3
#### Printing the first 10 rows.

In [84]:
print(df.head(10))

        name gender  count
0       Emma      F  15433
1  Charlotte      F  13285
2     Amelia      F  12952
3        Ava      F  12759
4     Sophia      F  12496
5   Isabella      F  11201
6        Mia      F  11096
7     Evelyn      F   9434
8     Harper      F   8388
9       Luna      F   8173

## Task 4
#### There are 315536 rows and 3 columns.

In [96]:
df.shape

(31536, 3)

## Task 5
#### The total number of babies born in 2021 is 3343647.

In [98]:
total_names = df["count"].sum()

total_names

3343647

## Task 6
#### 1609370 females and 1734277 males were born in 2021.

In [91]:
df_f = df[df["gender"] == "F"]

df_f = df_f["count"].sum()
df_f

1609370

In [92]:
df_m = df[df["gender"] == "M"]

df_m = df_m["count"].sum()
df_m

1734277

## Task 7
#### My name does not occur in the date. No surprise there.

In [110]:
print(df[df["name"] == "Till"])

Empty DataFrame
Columns: [name, gender, count]
Index: []

## Task 8
#### Calculating the percentages of girls (48%) and boys (52%) among total births in 2021.

In [99]:
df_percent_f = df_f / total_names * 100
df_percent_f

48.132174239684986

In [100]:
df_percent_m = df_m / total_names * 100
df_percent_m

51.867825760315014

## Task 9
#### Creating a data frame out of the top 5 female and male names of 2021 respectively.

In [131]:
# top 5 female names of 2021

df_f_topfive = df_f.head(5)
df_f_topfive

        name gender  count
0       Emma      F  15433
1  Charlotte      F  13285
2     Amelia      F  12952
3        Ava      F  12759
4     Sophia      F  12496

In [132]:
# top 5 male names of 2021

df_m_topfive = df_m.head(5)
df_m_topfive

         name gender  count
17543    Liam      M  20272
17544    Noah      M  18739
17545  Oliver      M  14616
17546  Elijah      M  12708
17547   James      M  12367

In [127]:
df_topfive_2021 = pd.concat([df_f_topfive, df_m_topfive], ignore_index=True)
df_topfive_2021

        name gender  count
0       Emma      F  15433
1  Charlotte      F  13285
2     Amelia      F  12952
3        Ava      F  12759
4     Sophia      F  12496
5       Liam      M  20272
6       Noah      M  18739
7     Oliver      M  14616
8     Elijah      M  12708
9      James      M  12367

## Task 10
#### Saving the new data frame to an excel file.

In [130]:
df_topfive_2021.to_excel("df_topfive_2021.xls")